--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\haalkmal\OneDrive - Syracuse University\Documents\work\tar
> iff_gdp_analysis.log
  log type:  text
 opened on:  26 Apr 2025, 20:39:02

. 
. * 1. Load Data
. import delimited "regression_data_full.csv", varnames(1) clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 674 obs)

. 
. * 2. Confirm variable names
. display ">> Variable list:"
>> Variable list:

. describe

Contains data
 Observations:           674                  
    Variables:             8                  
--------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------
countryname     str18   %18s                  Country Name
year            int     %8.0g                 Year
tariff_rate     float   %9.0g                 Tariff_Rate
gdp_growth_pct  float   %9.0g                 GDP_growth_pct
fdi_pct_gdp     float   %9.0g                 FDI_pct_gdp
inflation       float   %9.0g                 
pop_growth      float   %9.0g                 
tb_bil          float   %9.0g                 TB_bil
--------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. * 3. Create a numeric panel ID
. egen country_id = group(countryname), label

. 
. * 4. Declare panel structure
. xtset country_id year

Panel variable: country_id (unbalanced)
 Time variable: year, 1988 to 2022, but with gaps
         Delta: 1 unit

. display ">> Panel declared: country_id × year"
>> Panel declared: country_id × year

. 
. * 5. Generate squared tariff term
. gen tariff_rate_sq = tariff_rate^2

. 
. * 6. Summarize key variables
. display ">> Summaries of key variables:"
>> Summaries of key variables:

. summarize countryname year tariff_rate ///
>           gdp_growth_pct fdi_pct_gdp inflation pop_growth tb_bil

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 countryname |          0
        year |        674    2008.341    8.449968       1988       2022
 tariff_rate |        674    6.667596    6.910872          0      91.27
gdp_growth~t |        674    3.404811    3.903457  -17.00469   15.32916
 fdi_pct_gdp |        674    3.185373    6.061706  -30.77753   85.97855
-------------+---------------------------------------------------------
   inflation |        674    22.16974    171.9442  -8.237844   2947.733
  pop_growth |        674    1.346686    1.172769  -1.259889   9.539209
      tb_bil |        674   -10.06934    124.9855    -944.77   577.6089

. 
. * 7. Baseline Pooled OLS on GDP growth
. display "=== 7. Baseline Pooled OLS: GDP Growth on Tariffs ==="
=== 7. Baseline Pooled OLS: GDP Growth on Tariffs ===

. reg gdp_growth_pct tariff_rate, vce(cluster country_id)

Linear regression                               Number of obs     =        674
                                                F(1, 27)          =       7.14
                                                Prob > F          =     0.0126
                                                R-squared         =     0.0448
                                                Root MSE          =     3.8179

                            (Std. err. adjusted for 28 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
gdp_growth~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 tariff_rate |   .1195507   .0447459     2.67   0.013     .0277396    .2113618
       _cons |   2.607695   .4039297     6.46   0.000       1.7789    3.436491
------------------------------------------------------------------------------

. est store Pooled

. 
. * 8. OLS + Controls
. display "=== 8. OLS + Controls ==="
=== 8. OLS + Controls ===

. reg gdp_growth_pct tariff_rate fdi_pct_gdp inflation pop_growth, ///
>     vce(cluster country_id)

Linear regression                               Number of obs     =        674
                                                F(4, 27)          =       7.86
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0762
                                                Root MSE          =      3.763

                            (Std. err. adjusted for 28 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
gdp_growth~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 tariff_rate |   .1014901   .0511664     1.98   0.058    -.0034946    .2064749
 fdi_pct_gdp |   .0330344   .0340386     0.97   0.340     -.036807    .1028757
   inflation |  -.0019492   .0005809    -3.36   0.002    -.0031412   -.0007572
  pop_growth |   .5103376   .2639931     1.93   0.064    -.0313314    1.052007
       _cons |   1.978839   .4702744     4.21   0.000     1.013916    2.943762
------------------------------------------------------------------------------

. est store Controls

. 
. * 9. OLS + Controls + Tariff²
. display "=== 9. OLS + Controls + Tariff² ==="
=== 9. OLS + Controls + Tariff² ===

. reg gdp_growth_pct tariff_rate tariff_rate_sq fdi_pct_gdp inflation pop_growth
> , ///
>     vce(cluster country_id)

Linear regression                               Number of obs     =        674
                                                F(5, 27)          =       9.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1069
                                                Root MSE          =     3.7027

                             (Std. err. adjusted for 28 clusters in country_id)
-------------------------------------------------------------------------------
              |               Robust
gdp_growth_~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
  tariff_rate |   .2488985   .0643291     3.87   0.001     .1169062    .3808908
tariff_rate~q |  -.0031829   .0007281    -4.37   0.000    -.0046769   -.0016889
  fdi_pct_gdp |   .0372538   .0340497     1.09   0.284    -.0326103    .1071179
    inflation |  -.0022806   .0005752    -3.96   0.000    -.0034609   -.0011004
   pop_growth |    .367369   .2425623     1.51   0.142    -.1303277    .8650657
        _cons |   1.475713   .4030225     3.66   0.001     .6487793    2.302647
-------------------------------------------------------------------------------

. est store Quad

. 
. * 10. Country Fixed Effects
. display "=== 10. Country Fixed Effects ==="
=== 10. Country Fixed Effects ===

. xtreg gdp_growth_pct tariff_rate tariff_rate_sq fdi_pct_gdp inflation pop_grow
> th, ///
>     fe vce(cluster country_id)

Fixed-effects (within) regression               Number of obs     =        674
Group variable: country_id                      Number of groups  =         28

R-squared:                                      Obs per group:
     Within  = 0.0294                                         min =         12
     Between = 0.2913                                         avg =       24.1
     Overall = 0.0983                                         max =         34

                                                F(5, 27)          =      10.01
corr(u_i, Xb) = 0.2061                          Prob > F          =     0.0000

                             (Std. err. adjusted for 28 clusters in country_id)
-------------------------------------------------------------------------------
              |               Robust
gdp_growth_~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
  tariff_rate |   .1435924   .0373798     3.84   0.001     .0668954    .2202895
tariff_rate~q |  -.0021377   .0003883    -5.51   0.000    -.0029344    -.001341
  fdi_pct_gdp |   .0529879     .03658     1.45   0.159    -.0220682     .128044
    inflation |  -.0010472    .000378    -2.77   0.010    -.0018229   -.0002715
   pop_growth |   .3238616   .1963803     1.65   0.111    -.0790775    .7268008
        _cons |   2.062665   .3404128     6.06   0.000     1.364195    2.761134
--------------+----------------------------------------------------------------
      sigma_u |  1.9498898
      sigma_e |  3.3271816
          rho |  .25564934   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. est store FE_country

. 
. * 11. Time Fixed Effects
. display "=== 11. Time Fixed Effects ==="
=== 11. Time Fixed Effects ===

. reg gdp_growth_pct tariff_rate tariff_rate_sq fdi_pct_gdp inflation pop_growth
>  i.year, ///
>     vce(cluster country_id)

Linear regression                               Number of obs     =        674
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3539
                                                Root MSE          =     3.2327

                             (Std. err. adjusted for 28 clusters in country_id)
-------------------------------------------------------------------------------
              |               Robust
gdp_growth_~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
  tariff_rate |   .2106829   .0702337     3.00   0.006     .0665752    .3547907
tariff_rate~q |  -.0028814   .0007513    -3.84   0.001     -.004423   -.0013398
  fdi_pct_gdp |   .0118388   .0267174     0.44   0.661    -.0429808    .0666585
    inflation |  -.0023185    .000766    -3.03   0.005    -.0038902   -.0007468
   pop_growth |   .4098293   .2447126     1.67   0.106    -.0922795    .9119382
              |
         year |
        1989  |  -3.386686    1.21532    -2.79   0.010    -5.880318    -.893055
        1990  |  -2.598552   1.603369    -1.62   0.117    -5.888394    .6912906
        1991  |  -4.617826   1.693884    -2.73   0.011    -8.093389   -1.142263
        1992  |  -1.278857   2.088805    -0.61   0.545    -5.564731    3.007017
        1993  |  -1.529451   1.887095    -0.81   0.425     -5.40145    2.342548
        1994  |  -4.202943   4.193056    -1.00   0.325    -12.80638    4.400498
        1995  |  -2.416031   1.885343    -1.28   0.211    -6.284435    1.452373
        1996  |    -1.8946    1.69563    -1.12   0.274    -5.373745    1.584544
        1997  |  -2.473203   1.733831    -1.43   0.165     -6.03073    1.084323
        1998  |  -4.882177   2.744021    -1.78   0.086    -10.51244    .7480896
        1999  |   -3.45131   1.568322    -2.20   0.036    -6.669241   -.2333787
        2000  |  -1.769531    1.64522    -1.08   0.292    -5.145244    1.606182
        2001  |   -3.74682   1.869861    -2.00   0.055    -7.583459    .0898184
        2002  |  -3.041366   1.871016    -1.63   0.116    -6.880375    .7976422
        2003  |  -2.926751   1.877248    -1.56   0.131    -6.778545    .9250435
        2004  |  -1.398973   1.874939    -0.75   0.462     -5.24603    2.448084
        2005  |  -1.681143   1.916192    -0.88   0.388    -5.612845     2.25056
        2006  |  -1.033237   1.935248    -0.53   0.598    -5.004038    2.937564
        2007  |  -1.642757   1.945328    -0.84   0.406    -5.634239    2.348725
        2008  |  -2.676042   1.963713    -1.36   0.184    -6.705248    1.353163
        2009  |  -6.619216   2.103561    -3.15   0.004    -10.93537   -2.303065
        2010  |  -1.678307   1.884518    -0.89   0.381    -5.545018    2.188404
        2011  |  -2.945566   2.023959    -1.46   0.157    -7.098388    1.207255
        2012  |  -4.680496   2.228255    -2.10   0.045    -9.252498   -.1084937
        2013  |  -3.851336   1.869313    -2.06   0.049    -7.686849   -.0158224
        2014  |  -3.253402   1.861944    -1.75   0.092    -7.073796    .5669919
        2015  |  -3.290832   1.923711    -1.71   0.099     -7.23796    .6562964
        2016  |  -3.821528   1.855358    -2.06   0.049    -7.628408   -.0146486
        2017  |  -3.025149   1.893454    -1.60   0.122    -6.910196    .8598979
        2018  |  -2.681738   1.888348    -1.42   0.167    -6.556308    1.192831
        2019  |  -3.576221   1.850532    -1.93   0.064    -7.373198     .220757
        2020  |  -10.08244   1.877571    -5.37   0.000    -13.93489   -6.229979
        2021  |   .2308782   2.016867     0.11   0.910    -3.907391    4.369147
        2022  |  -1.303503   1.865884    -0.70   0.491     -5.13198    2.524975
              |
        _cons |   4.765013   1.954243     2.44   0.022     .7552373    8.774788
-------------------------------------------------------------------------------

. est store FE_time

. 
. * 12. Two-Way Fixed Effects (Country + Time)
. display "=== 12. Two-Way Fixed Effects ==="
=== 12. Two-Way Fixed Effects ===

. xtreg gdp_growth_pct tariff_rate tariff_rate_sq fdi_pct_gdp inflation pop_grow
> th i.year, ///
>     fe vce(cluster country_id)

Fixed-effects (within) regression               Number of obs     =        674
Group variable: country_id                      Number of groups  =         28

R-squared:                                      Obs per group:
     Within  = 0.3706                                         min =         12
     Between = 0.4872                                         avg =       24.1
     Overall = 0.3062                                         max =         34

                                                F(27, 27)         =          .
corr(u_i, Xb) = 0.0710                          Prob > F          =          .

                             (Std. err. adjusted for 28 clusters in country_id)
-------------------------------------------------------------------------------
              |               Robust
gdp_growth_~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
  tariff_rate |    .041216   .0654548     0.63   0.534    -.0930861     .175518
tariff_rate~q |  -.0011412   .0006084    -1.88   0.072    -.0023895    .0001071
  fdi_pct_gdp |   .0181764   .0247197     0.74   0.468    -.0325443     .068897
    inflation |  -.0011117   .0005305    -2.10   0.046    -.0022002   -.0000231
   pop_growth |    .173411   .1983372     0.87   0.390    -.2335434    .5803653
              |
         year |
        1989  |   -3.47068    .868523    -4.00   0.000    -5.252742   -1.688618
        1990  |  -2.990423   1.819704    -1.64   0.112    -6.724146    .7433008
        1991  |  -4.202285   1.462492    -2.87   0.008    -7.203071   -1.201499
        1992  |  -2.365925   1.593353    -1.48   0.149    -5.635216    .9033663
        1993  |  -2.348828   1.325922    -1.77   0.088    -5.069396    .3717399
        1994  |  -5.400887   3.606236    -1.50   0.146    -12.80027    1.998497
        1995  |  -3.486396   1.517613    -2.30   0.030    -6.600281   -.3725104
        1996  |  -2.520845   1.274448    -1.98   0.058    -5.135797    .0941064
        1997  |   -3.31561   1.334074    -2.49   0.019    -6.052904   -.5783173
        1998  |  -6.060649   2.389588    -2.54   0.017    -10.96368   -1.157619
        1999  |   -4.51789   1.137295    -3.97   0.000    -6.851427   -2.184354
        2000  |  -2.298384    1.24582    -1.84   0.076    -4.854595    .2578273
        2001  |   -4.36891   1.465642    -2.98   0.006    -7.376159    -1.36166
        2002  |   -3.65766   1.568957    -2.33   0.027    -6.876894   -.4384265
        2003  |  -3.617495   1.509631    -2.40   0.024    -6.715002   -.5199883
        2004  |  -2.365335   1.537443    -1.54   0.136    -5.519907    .7892378
        2005  |  -2.609437   1.571806    -1.66   0.108    -5.834516    .6156425
        2006  |   -2.05783   1.547693    -1.33   0.195    -5.233433    1.117773
        2007  |  -2.648353   1.608972    -1.65   0.111    -5.949691    .6529859
        2008  |  -3.759483   1.615979    -2.33   0.028    -7.075198   -.4437676
        2009  |  -7.664017   1.632968    -4.69   0.000    -11.01459   -4.313443
        2010  |  -2.742288   1.550996    -1.77   0.088    -5.924668    .4400925
        2011  |  -4.019452   1.719957    -2.34   0.027    -7.548513   -.4903915
        2012  |  -5.507323    1.87885    -2.93   0.007    -9.362405   -1.652241
        2013  |  -4.533665   1.577082    -2.87   0.008    -7.769569   -1.297761
        2014  |  -4.138054   1.559416    -2.65   0.013     -7.33771   -.9383974
        2015  |   -4.47809   1.535446    -2.92   0.007    -7.628565   -1.327614
        2016  |    -4.9654    1.47381    -3.37   0.002    -7.989409   -1.941392
        2017  |  -3.971128   1.555098    -2.55   0.017    -7.161926   -.7803304
        2018  |  -3.941396   1.551812    -2.54   0.017    -7.125451   -.7573416
        2019  |  -4.535533   1.477835    -3.07   0.005      -7.5678   -1.503266
        2020  |  -11.21273   1.648435    -6.80   0.000    -14.59504   -7.830423
        2021  |  -1.111123   1.738751    -0.64   0.528    -4.678746    2.456501
        2022  |  -2.619036   1.602987    -1.63   0.114    -5.908095    .6700224
              |
        _cons |   6.946887   1.713056     4.06   0.000     3.431986    10.46179
--------------+----------------------------------------------------------------
      sigma_u |  2.0500804
      sigma_e |  2.7532634
          rho |  .35667713   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. est store FE_twoway

. 
. * 13. Pooled OLS on Trade Balance (TB_bil)
. display "=== 13. Pooled OLS: Trade Balance on Tariffs ==="
=== 13. Pooled OLS: Trade Balance on Tariffs ===

. reg tb_bil tariff_rate tariff_rate_sq fdi_pct_gdp inflation pop_growth, ///
>     vce(cluster country_id)

Linear regression                               Number of obs     =        674
                                                F(5, 27)          =       2.34
                                                Prob > F          =     0.0687
                                                R-squared         =     0.0168
                                                Root MSE          =     124.39

                             (Std. err. adjusted for 28 clusters in country_id)
-------------------------------------------------------------------------------
              |               Robust
       tb_bil | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
  tariff_rate |   3.329543   3.893911     0.86   0.400    -4.660102    11.31919
tariff_rate~q |  -.0419521   .0469682    -0.89   0.380    -.1383229    .0544188
  fdi_pct_gdp |   1.614308   1.138221     1.42   0.168    -.7211275    3.949744
    inflation |  -.0003078   .0053396    -0.06   0.954    -.0112637    .0106481
   pop_growth |  -.1973631   10.23771    -0.02   0.985    -21.20341    20.80868
        _cons |  -33.27323   52.62646    -0.63   0.533    -141.2538    74.70735
-------------------------------------------------------------------------------

. est store TB

. 
. * ─── Close the log ────────────────────────────────────
. log close
      name:  <unnamed>
       log:  C:\Users\haalkmal\OneDrive - Syracuse University\Documents\work\tar
> iff_gdp_analysis.log
  log type:  text
 closed on:  26 Apr 2025, 20:39:03
--------------------------------------------------------------------------------
